app/Controllers/ArtistaController.php

SELECT COUNT(*) AS `numrows`
FROM `artistas`
---
    public function index()
    {
        $artistaModel = new ArtistaModel();

        // Captura y validación de parámetros
        $filters = [
            'nombre' => $this->request->getGet('nombre'),
            'descripcion' => $this->request->getGet('descripcion'),
            'genero' => $this->request->getGet('genero'),
        ];

        $sort = $this->request->getGet('sort') ?? 'id';
        $order = $this->request->getGet('order') ?? 'asc';

        // Aplicar filtros si existen
        foreach ($filters as $campo => $valor) {
            if (!empty($valor)) {
                $artistaModel->like("artistas.$campo", $valor);
            }
        }

        // Contar el total de registros (sin paginación)
        $totalRegistros = $artistaModel->countAllResults(false);

SELECT *
FROM `artistas`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `artistas`
---
        $page = $this->request->getVar('page') ?? 1;

        // Obtener datos paginados con filtros y ordenación
        $data = [
            'artistas' => $artistaModel->paginate($perPage),
            'pager' => $artistaModel->pager,
            'filters' => $filters, // Pasar los filtros a la vista
            'sort' => $sort,
            'order' => $order,
            'perPage' => $perPage,
            'page' => $page,
            'totalRegistros' => $totalRegistros, // Número total de registros
        ];