app/Controllers/ArtistaController.php

    public function index()
    {
        $artistaModel = new ArtistaModel();
        $data['artistas'] = $artistaModel->findAll(); // Obtener todos los artistas
---
SELECT *
FROM `artistas`
 LIMIT 10

    public function saveArtista($id = null)
    {
        $artistaModel = new ArtistaModel();
        helper(['form', 'url']);
        // Cargar datos del usuario si es edición
        $data['artista'] = $id ? $artistaModel->find($id) : null;

        if ($this->request->getMethod() == 'POST') {

            // Reglas de validación
            // $validation = \Config\Services::validation();
            // $validation->setRules([
            //     'name' => 'required|min_length[3]|max_length[50]',
            //     'email' => 'required|valid_email',
            // ]);

            // if (!$validation->withRequest($this->request)->run()) {
            //     // Mostrar errores de validación
            //     $data['validation'] = $validation;
            // } else {
            //     Preparar datos del formulario
                $artistaData = [
                    'nombre' => $this->request->getPost('nombre'),
                    'descripcion' => $this->request->getPost('descripcion'),
                    'genero' => $this->request->getPost('genero')

                ];

                if ($id) {
                    // Actualizar usuario existente
                    $artistaModel->update($id, $artistaData);
---
SELECT *
FROM `artistas`
WHERE `artistas`.`id` = '1'
UPDATE `artistas` SET `nombre` = 'The Rolling Stones', `descripcion` = 'Banda de rock legendaria fundada en Londres, conocida por sus conciertos explosivos y su impacto cultural en la música.', `genero` = 'rock'
WHERE `artistas`.`id` IN ('1')