app/Controllers/AuthController.php

    public function login()
    {
        $request = service('request');
    if ($request->getMethod() === 'POST') {
        $email = $request->getPost('email');
        $password = $request->getPost('password');

        // Cargar el modelo de usuario
        $userModel = new \App\Models\UserModel();

        // Buscar el usuario en la base de datos
        $user = $userModel->where('email', $email)->first();

        if ($user && $password == $user['password']) {
            // Autenticación exitosa
            $roleModel = new \App\Models\RolModel();

            // Buscar el rol correspondiente en la base de datos
            $role = $roleModel->find($user['role_id']);
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '3'