app/Controllers/EntradaController.php

SELECT *
FROM `entradas`
WHERE `entradas`.`id` = '7'
UPDATE `entradas` SET `is_active` = 0
WHERE `entradas`.`id` IN ('7')
---
    public function toggleActive($id)
    {
        $entradaModel = new EntradaModel();
        $entrada = $entradaModel->find($id);

        if ($entrada) {
            // Cambiar el estado actual
            $newStatus = $entrada['is_active'] ? 0 : 1;
            $message = $newStatus ? 'Entrada dado de alta correctamente.' : 'Entrada dado de baja correctamente.';

            // Actualizar en la base de datos
            $entradaModel->update($id, ['is_active' => $newStatus]);