app/Controllers/Home.php

    public function principal(){
        $session = session();
        $rolModel = new RolModel();
        $rol = $rolModel->find($session->get('role'));
        // var_dump($rol);die();
        $data = [
            'name' => $session->get('name'),
            'email' => $session->get('email'),
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = '1'
SELECT *
FROM `roles`
WHERE `roles`.`id` IN ('1','admin')