app/Controllers/PatrocinadorController.php

    public function index()
    {
        $patrocinadorModel = new PatrocinadorModel();
        $filters = $this->request->getGet();  // Obtener filtros del formulario

        // Configurar paginación
        $perPage = 10;
        $currentPage = $this->request->getVar('page') ? $this->request->getVar('page') : 1;
        $sort = $this->request->getVar('sort') ? $this->request->getVar('sort') : 'nombre';
        $direction = $this->request->getVar('direction') ? $this->request->getVar('direction') : 'ASC';

        // Remover los parámetros 'sort', 'direction' y 'page' de los filtros
        unset($filters['sort']);
        unset($filters['direction']);
        unset($filters['page']);

        // Obtener datos paginados con filtros y ordenación
        $data['patrocinadores'] = $patrocinadorModel->filter($filters)
                                                    ->orderBy($sort, $direction)
                                                    ->paginate($perPage, 'default', $currentPage);
---
SELECT *
FROM `patrocinadores`
ORDER BY `nombre` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `patrocinadores`