app/Controllers/RolController.php

SELECT *
FROM `roles`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `roles`
---
    public function index()
    {
        $rolModel = new RolModel();
        $filters = $this->request->getGet();  // Obtener filtros del formulario

        // Configurar paginación
        $perPage = 10;
        $currentPage = $this->request->getVar('page') ? $this->request->getVar('page') : 1;

        // Obtener datos paginados con filtros
        $data['roles'] = $rolModel->filter($filters)
                                  ->paginate($perPage, 'default', $currentPage);