app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '2'
---
    public function saveUser($id = null)
    {
        $userModel = new UserModel();
        helper(['form', 'url']);
        // Cargar datos del usuario si es edición
        $data['user'] = $id ? $userModel->find($id) : null;

UPDATE `users` SET `name` = 'María Lópe', `email` = 'maria.lopez@example.com', `updated_at` = '2025-03-04 19:03:20'
WHERE `users`.`id` IN ('2')
---
                    $message = 'Usuario actualizado correctamente.';
                } else {
                    // Crear nuevo usuario
                    $userModel->save($userData);